app/controllers/articals_controller.rb

  def index
    @articals = Artical.all
---
SELECT "articals".* FROM "articals"

  def create
    @artical = Artical.new(artical_params)

    respond_to do |format|
      if @artical.save
---
INSERT INTO "articals" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["body", "ghhgc "], ["created_at", "2021-08-28 04:59:15.121812"], ["updated_at", "2021-08-28 04:59:15.121812"], ["user_id", 2]]

  def update
    respond_to do |format|
      if @artical.update(artical_params)
---
UPDATE "articals" SET "title" = ?, "updated_at" = ? WHERE "articals"."id" = ?  [["title", "React "], ["updated_at", "2021-08-28 05:14:53.083741"], ["id", 3]]

  def destroy
    @artical.destroy
---
DELETE FROM "articals" WHERE "articals"."id" = ?  [["id", 1]]

    def set_artical
      @artical = Artical.find(params[:id])
---
SELECT "articals".* FROM "articals" WHERE "articals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]