app/controllers/pages_controller.rb

SELECT "articals".* FROM "articals"
---
  def index
    @articals =Artical.all